OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f46j50.h
#define _T3CCP1                 0x01
#define _T3CCP2                 0x02
#define _T1RUN                  0x10

//==============================================================================


//==============================================================================
//        CVRCON Bits

extern __at(0x0F53) __sfr CVRCON;

typedef union
  {
  struct
    {
    unsigned CVR0               : 1;
    unsigned CVR1               : 1;
    unsigned CVR2               : 1;
    unsigned CVR3               : 1;
    unsigned CVRSS              : 1;
    unsigned CVRR               : 1;
    unsigned CVROE              : 1;
    unsigned CVREN              : 1;
    };

  struct
    {
    unsigned CVR                : 4;
    unsigned                    : 4;
    };
  } __CVRCONbits_t;

extern __at(0x0F53) volatile __CVRCONbits_t CVRCONbits;

#define _CVR0                   0x01
#define _CVR1                   0x02
#define _CVR2                   0x04
#define _CVR3                   0x08
#define _CVRSS                  0x10
#define _CVRR                   0x20
#define _CVROE                  0x40
#define _CVREN                  0x80

//==============================================================================


//==============================================================================
//        PMSTATL Bits

extern __at(0x0F54) __sfr PMSTATL;

typedef struct
  {
  unsigned OB0E                 : 1;
  unsigned OB1E                 : 1;
  unsigned OB2E                 : 1;
  unsigned OB3E                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned OBUF                 : 1;
  unsigned OBE                  : 1;
  } __PMSTATLbits_t;

extern __at(0x0F54) volatile __PMSTATLbits_t PMSTATLbits;

#define _OB0E                   0x01
#define _OB1E                   0x02
#define _OB2E                   0x04
#define _OB3E                   0x08
#define _OBUF                   0x40
#define _OBE                    0x80

//==============================================================================


//==============================================================================
//        PMSTATH Bits

extern __at(0x0F55) __sfr PMSTATH;

typedef struct
  {
  unsigned IB0F                 : 1;
  unsigned IB1F                 : 1;
  unsigned IB2F                 : 1;
  unsigned IB3F                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IBOV                 : 1;
  unsigned IBF                  : 1;
  } __PMSTATHbits_t;

extern __at(0x0F55) volatile __PMSTATHbits_t PMSTATHbits;

#define _IB0F                   0x01
#define _IB1F                   0x02
#define _IB2F                   0x04
#define _IB3F                   0x08
#define _IBOV                   0x40
#define _IBF                    0x80

//==============================================================================


//==============================================================================
//        PMEL Bits

extern __at(0x0F56) __sfr PMEL;

typedef struct
  {
  unsigned PTEN0                : 1;
  unsigned PTEN1                : 1;
  unsigned PTEN2                : 1;
  unsigned PTEN3                : 1;
  unsigned PTEN4                : 1;
  unsigned PTEN5                : 1;
  unsigned PTEN6                : 1;
  unsigned PTEN7                : 1;
  } __PMELbits_t;

extern __at(0x0F56) volatile __PMELbits_t PMELbits;

#define _PTEN0                  0x01
#define _PTEN1                  0x02
#define _PTEN2                  0x04
#define _PTEN3                  0x08
#define _PTEN4                  0x10
#define _PTEN5                  0x20
#define _PTEN6                  0x40
#define _PTEN7                  0x80

//==============================================================================


//==============================================================================
//        PMEH Bits

extern __at(0x0F57) __sfr PMEH;

typedef struct
  {
  unsigned PTEN8                : 1;
  unsigned PTEN9                : 1;
  unsigned PTEN10               : 1;
  unsigned PTEN11               : 1;
  unsigned PTEN12               : 1;
  unsigned PTEN13               : 1;
  unsigned PTEN14               : 1;
  unsigned PTEN15               : 1;
  } __PMEHbits_t;

extern __at(0x0F57) volatile __PMEHbits_t PMEHbits;

#define _PTEN8                  0x01
#define _PTEN9                  0x02
#define _PTEN10                 0x04
#define _PTEN11                 0x08
#define _PTEN12                 0x10
#define _PTEN13                 0x20
#define _PTEN14                 0x40
#define _PTEN15                 0x80

//==============================================================================

extern __at(0x0F58) __sfr PMDIN2L;
extern __at(0x0F59) __sfr PMDIN2H;
extern __at(0x0F5A) __sfr PMDOUT2L;
extern __at(0x0F5B) __sfr PMDOUT2H;

//==============================================================================
//        PMMODEL Bits

extern __at(0x0F5C) __sfr PMMODEL;

typedef union
  {
  struct
    {
    unsigned WAITE0             : 1;
    unsigned WAITE1             : 1;
    unsigned WAITM0             : 1;
    unsigned WAITM1             : 1;
    unsigned WAITM2             : 1;
    unsigned WAITM3             : 1;
    unsigned WAITB0             : 1;
    unsigned WAITB1             : 1;
    };

  struct
    {
    unsigned WAITE              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned WAITM              : 4;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned WAITB              : 2;
    };
  } __PMMODELbits_t;

extern __at(0x0F5C) volatile __PMMODELbits_t PMMODELbits;

#define _WAITE0                 0x01
#define _WAITE1                 0x02
#define _WAITM0                 0x04
#define _WAITM1                 0x08
#define _WAITM2                 0x10
#define _WAITM3                 0x20
#define _WAITB0                 0x40
#define _WAITB1                 0x80

//==============================================================================


//==============================================================================
//        PMMODEH Bits

extern __at(0x0F5D) __sfr PMMODEH;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE16             : 1;
    unsigned INCM0              : 1;
    unsigned INCM1              : 1;
    unsigned IRQM0              : 1;
    unsigned IRQM1              : 1;
    unsigned BUSY               : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned INCM               : 2;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned IRQM               : 2;
    unsigned                    : 1;
    };
  } __PMMODEHbits_t;

